{
    "posts": [
        {
            "id": "x2k5kv",
            "title": "Am I the bad one? for bringing my SIL’s wallet to the restaurant when she conveniently always forgets it?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 4
        },
        {
            "id": "cjetsa",
            "title": "UPDATE: Am I the bad one? for wanting to go to the funeral of a girl that I helped get addicted to drugs?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 5
        },
        {
            "id": "e5k3z2",
            "title": "Am I the bad one? for pretending to get fired when customers get a temper with me?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 6
        },
        {
            "id": "dhfeg9",
            "title": "Am I the bad one? for making a dad joke?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 9
        },
        {
            "id": "ocx94s",
            "title": "Am I the bad one? for telling my wife the lock on my daughter's door does not get removed til my brother inlaw and his daughters are out of our house?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 0
        },
        {
            "id": "zvmflw",
            "title": "Am I the bad one? for bringing up my brother's \"premature\" birth at Christmas dinner to get my parents to shut up?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 7
        },
        {
            "id": "flan73",
            "title": "UPDATE: WIBTA if I took over planning my own funeral from my very religious parents?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 8
        },
        {
            "id": "wyjbjs",
            "title": "Am I the bad one? for not taking down my video that was a gift from my best man.",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 10
        },
        {
            "id": "cihc3z",
            "title": "Am I the bad one? for telling my extended family how many men (roughly) my sister has slept with after she outed our youngest brother as a virgin?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 11
        },
        {
            "id": "aysa03",
            "title": "META: Too many Am I the bad one? commenters advocate too quickly for people to leave their partners at the first sign of conflict, and this kind of thinking deprives many people of emotional growth.",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 12
        },
        {
            "id": "iagtso",
            "title": "Am I the bad one? for punishing my son after he said something racist?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 13
        },
        {
            "id": "ofol5x",
            "title": "Am I the bad one? for \"announcing\" that my dad's not paying my college tuition",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 14
        },
        {
            "id": "ur2l3s",
            "title": "UPDATE Am I the bad one? for walking out of the Airport when I saw my husband's mom standing there with her luggage?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 15
        },
        {
            "id": "dkqv29",
            "title": "WIBTA for refusing to stop cooking bacon in my kitchen due to my teenage daughters vegan lifestyle?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 16
        },
        {
            "id": "d7yuot",
            "title": "Aita for wearing the “joke” bikini my friend got me?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 17
        },
        {
            "id": "hf4bc4",
            "title": "UPDATE WIBTA For planting prickly bushes in my front yard to keep the neighbours kids from my property?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 18
        },
        {
            "id": "ouje2w",
            "title": "Am I the bad one? for refusing to pay for my sister's husband's surgery with my inheritance/college money?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 20
        },
        {
            "id": "unhse2",
            "title": "Am I the bad one? for walking out of the Airport when I saw my husband's mom standing there with her luggage?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 21
        },
        {
            "id": "vlelqu",
            "title": "Am I the bad one? for storming off from my sister's wedding after she deadnamed my son?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 22
        },
        {
            "id": "zz5str",
            "title": "Am I the bad one? for getting up from my chair in the middle of christmas dinner and shouting \"SHUT THE FUCK UP ABOUT MY BODYYYYY\" in response to my husband's observation?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 23
        },
        {
            "id": "opgizn",
            "title": "[UPDATE] Am I the bad one? for telling an employee she can choose between demotion or termination?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 24
        },
        {
            "id": "i1bxoe",
            "title": "UPDATE Am I the bad one? for not sharing my medical history before being pranked?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 25
        },
        {
            "id": "daglhs",
            "title": "Am I the bad one? for telling my son he deserved his gf breaking up with him?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 26
        },
        {
            "id": "i9pm5u",
            "title": "Am I the bad one? - Telling my parents to pay me back my college tuition if they want a relationship",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 28
        },
        {
            "id": "100ogg4",
            "title": "Am I the bad one? for silently getting up and walking out of the restaurant during NYE dinner after I was told to pay for everyone at the table (my inlaws)?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 29
        },
        {
            "id": "d10cpy",
            "title": "Am I the bad one? for sleeping naked on top of the covers to teach my flatmate's gf a lesson?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 30
        },
        {
            "id": "hvcvtt",
            "title": "Am I the bad one? for switching to regular milk to prove my lactose intolerant roommate keeps stealing from me?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 32
        },
        {
            "id": "fzvxw7",
            "title": "Am I the bad one? for telling my girlfriend to shut the fuck up after she insulted my sisters thighs?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 33
        },
        {
            "id": "b43t53",
            "title": "Am I the bad one? for giving my ex wife a large amount of money I won despite the anger of my gf?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 34
        },
        {
            "id": "j0rjfm",
            "title": "(UPDATE) Am I the bad one? for telling my step-daughter to “go ask her real dad” when she asked me to pay for her plane tickets?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 35
        },
        {
            "id": "10av2g7",
            "title": "Am I the bad one? for kicking out one of my bridesmaids for showing up in the wrong dress?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 36
        },
        {
            "id": "iix7su",
            "title": "UPDATE: Am I the bad one? for telling my girlfriend that being depressed is not an excuse for being lazy?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 37
        },
        {
            "id": "i4sa5r",
            "title": "UPDATE: A month ago I was told I WBTA for not telling a date about my plans to be a single mother, so I told him",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 38
        },
        {
            "id": "zdk3bq",
            "title": "Am I the bad one? for how I fought my boyfriend's medical bill, going \"too far\"?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 39
        },
        {
            "id": "ob0wdk",
            "title": "Am I the bad one? for not letting my best friend have her wedding on my property after being uninvited?",
            "subreddit": "AmItheA--hole",
            "status": "lengthcap",
            "index": 40
        },
        {
            "id": "dtg4jw",
            "title": "Am I the bad one? for telling the girl who kissed my boyfriend for a play that she is desperate and pathetic?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 41
        },
        {
            "id": "efcc8u",
            "title": "Am I the bad one? for jumping out of a bathroom window to avoid my mom’s attempt at forcing a reunion between me and my ex fiancé?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 42
        },
        {
            "id": "101hya0",
            "title": "Am I the bad one? for refusing to tell my husband the gender of our baby after he skipped going to the dr appointment with me?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 43
        },
        {
            "id": "e3f7tf",
            "title": "Am I the bad one? if I stop paying my daughter’s tuition over a disgusting comment she made towards my new girlfriend?",
            "subreddit": "AmItheA--hole",
            "status": "generated",
            "index": 45
        },
        {
            "id": "g4ewp7",
            "title": "Today I saw the man that saved me when I was being raped",
            "subreddit": "offmychest",
            "status": "lengthcap",
            "index": 0
        },
        {
            "id": "fgj4m9",
            "title": "To those who are stockpiling over the Coronavirus, fuck you.",
            "subreddit": "offmychest",
            "status": "generated",
            "index": 3
        },
        {
            "id": "hv24zz",
            "title": "Wearing a mask has nothing to do with politics. I am a conservative and I wear a mask because I respect everyone elses safety. Stop being stupid and wear a fucking mask you dense mother fuckers",
            "subreddit": "offmychest",
            "status": "generated",
            "index": 5
        },
        {
            "id": "gyqgos",
            "title": "No one in my family really cares, so I’ll celebrate here! I got a 4.0 GPA!",
            "subreddit": "offmychest",
            "status": "generated",
            "index": 6
        },
        {
            "id": "hlaopw",
            "title": "I’m an Iraq War veteran who risked his life for this country (whether it actually helped anyone is debatable), and I am NOT feeling patriotic this Independence Day.",
            "subreddit": "offmychest",
            "status": "generated",
            "index": 9
        }
    ]
}